app/Models/ModelStaff.php

SELECT *
FROM `tbl_staff`
---
    public function allData()
    {
        return $this->db->table('tbl_staff')->get()->getResultArray();