app/Models/ModelCarousel.php

SELECT *
FROM `tbl_carousel`
---
    public function allData()
    {
        return $this->db->table('tbl_carousel')->get()->getResultArray();