app/Models/ModelLayanan.php

    public function allData()
    {
        return $this->db->table('tbl_layanan')->get()->getResultArray();
---
SELECT *
FROM `tbl_layanan`