app/Models/ModelRoom.php

    public function allData()
    {
        return $this->db->table('tbl_room')
        ->join('tbl_roomtype', 'tbl_roomtype.id_roomtype = tbl_room.id_roomtype', 'left')->get()->getResultArray();
---
SELECT *
FROM `tbl_room`
LEFT JOIN `tbl_roomtype` ON `tbl_roomtype`.`id_roomtype` = `tbl_room`.`id_roomtype`