app/Models/ModelTestimoni.php

    public function allData()
    {
        return $this->db->table('tbl_testimoni')->get()->getResultArray();
---
SELECT *
FROM `tbl_testimoni`