app/Models/ModelRoomType.php

    public function allData()
    {
        return $this->db->table('tbl_roomtype')->get()->getResultArray();
---
SELECT *
FROM `tbl_roomtype`